// ИНИЦИАЛИЗАЦИЯ
var appContent = {};

// В этом файле находится вся статическая информация на сайте.

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Здесь располагается вся информация на главной странице, находящаяся до слайдера с картинками.

appContent.beforeSlider = `
<h1>Главная</h1>
<p class="i">Сайт коллектива детей 7–17 лет, педагогов, выпускников и родителей. Мы занимаемся программированием и WEB–конструированием.</p>
<br>
`

// А тут располагается вся информация на главной странице, находящаяся после слайдера с картинками.

appContent.afterSlider = `
<p>Творческая лаборатория «Проект К–16» выросла из кружка «Программист» Городского Дворца детского (юношеского) творчества города Омска (Красный путь, 155).</p>

<p class="right">Почему К–16? Потому, что мы находимся в кабинете 16 Городского Дворца детского (юношеского) творчества.</p.right>

<p>Почему творческая лаборатория — это понятно. Мы разрабатываем программы, изучаем новые технологии для работы в Интернете, рисуем и участвуем в различных проектах.</p>

<p>На страницах сайта можно узнать об истории, об образовательной программе, реализуемой в творческой лаборатории, о наших достижениях, праздниках, детях, педагогах, выпускниках.</p>

<p>Этот сайт был сделан «ручками», без помощи готовых движков, потому что мы придерживаемся мнения Дуванова Александра Александровича, руководителя Роботландского университета:</p>

<div class=".q-container">
	<span class="q-left">«</span>
	<q>Надо потихоньку со школы учить тех, кто будет в состоянии писать готовые движки, выбрав соответствующую профессию. Ведь изготовление сайта на движке практически не дает настоящего представления об этой профессии. Если в школе учить только пользоваться программами, и не учить программировать, то как ребятам узнать, что программирование — это их призвание?</q>
	<span class="q-right">»</span>
</div>
`


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Здесь находится вся информация со страницы "Мероприятия".

appContent.activity = `
<h1>Мероприятия</h1>

<p>Наш коллектив поддерживает традиции, которые с момента становления кружка «Программист» годами накапливались.</p>

<p>С каждым годом появляется много новых мероприятий, но традиционными мы считаем следующие:</p>

<h2>День Новичка</h2>

<p>Это сравнительно новая наша традиция. Нам показалось логичным, что новичков надо встречать, чтобы с первых дней они почувствовали, что они здесь нужны. Каждый год праздник проходит по новому сценарию, который с удовольствием и азартом готовят старшие.</p>

<p>В этот раз новички боролись с <b>Королем в Желтом</b> — существом, не имеющим обличий, которое ходит из мира в мир и порабощает или уничтожает их. В каждом мире существует артефакт, с помощью которого он появляется в мире и с помощью которого его можно изгнать. В нашем мире этим артефактом был <b>священный винт</b>.</p>

<p class="right">Совершенно случайно в 2009 году День Новичка совпал с Днем Программиста (13 сентября)! Это хорошее предзнаменование.</p>

<p>Сегодня ночью это существо проникло в этот мир и украло из нашего монастыря артефакт. Мы собрали экстренную комиссию представителей всех народов. Целью Короля в Желтом является <b>уничтожение священного винта</b>.</p>

<p>Задача новичков — найти его, отобрать священный винт, изгнать с помощью заклинаний и уничтожить этот артефакт. Но уничтожить винт можно, лишь собрав представителей всех народов и прочитав заклинание задом наперед.</p>

<p>Испытания:</p>

<ul class="list">
    <li>Нежить</li>
    <li>Люди</li>
    <li>Эльфы</li>
    <li>Орки</li>
    <li>Маги</li>
    <li>Элементали</li>
    <li>Бесы</li>
</ul>

<div class="hr"></div>

<p>Спасибо старшим ребятам за сценарий, самостоятельную организацию праздника, хороший реквизит и костюмы.</p>

<h2>Посвящение</h2>

<p>Посвящение в программисты является великолепным примером мягкой смены поколений. Уходят одиннадцатиклассники, приходят новички. Но никто никогда не покинет Дворец навсегда.</p>

<p>Посвящение в программисты проводится каждый год. Это очень веселое и интересное мероприятие. Первая поездка коллектива на Творческую дачу в Кормиловке, знакомство с педагогическим отрядом «Бриг» дали начало этой традиции.</p>

<p>В <b>1994</b> году было наше первое посвящение. Посвящают в программисты тех ребят, кто уже один год отзанимался в кружке и оказался достоин этой чести.</p>

<p class="right">Уходят одиннадцатиклассники, приходят новички. Но никто никогда не покинет Дворец навсегда.</p>

<p>Сначала ребятам надо пройти испытания во всех укромных уголках Дворца.</p>

<h3>«Угадай мелодию»</h3>
<p>Ребятам предлагается спеть какую-либо песню под гитару и угадать ее название и автора. Много новых песен ребята узнают в Летней школе научного общества учащихся, где практически все берут гитару в руки и начинают играть.</p>

<h3>«Цепочка из одежды»</h3>
<p>Ребята из команды и ведущие по-очереди снимают какой-нибудь предмет одежды и связывают на полу в цепочку. Побеждает та команда, у которой цепочка оказалась длиннее. В дело идет все: шнурки от ботинок и сотовых телефонов, бумажные деньги и все остальное.</p>

<h3>«Макароны»</h3>
<p>Ребятам предлагается вытащить зубами шарик от компьютерной мышки из тарелки с макаронами и кетчупом без помощи рук.</p>

<h3>«Мумия»</h3>
<p>В темноте и с закрытыми глазами человек трогает мумию программиста, а когда очередь доходит до головы, испытуемый опускает руки в сосуд с мозгами усопшего программиста, а мумия издает душераздирающее шипение.</p>

<h3>«Стулья»</h3>
<p>Вся команда садится на стулья в кругу, затем каждый последующий человек кладет свою голову на коленки предыдущего человека. Потом все стулья убираются, а команда в таком положении должна сделать три шага.</p>

<div class="hr"></div>

<p>И только после всех испытаний при свечах в торжественной обстановке новички приносят клятву и знакомятся с традициями кружка.</p>

<p>Затем «Орлятский круг» с песнями под гитару. Традиционными стали песни «Разговоры еле слышны», «Дождь», «Перевал», «Мамонты» и другие.</p>

<p>Замечательно то, что все мероприятия в нашем коллективе организуют сами ребята, получая при этом большое удовольствие.</p>

<h2>Ночной Сбор</h2>

<p>Новогодний Ночной сбор — один из самых любимых наших праздников. Его организуют сами ребята. Мы собираемся во Дворце в последнюю субботу декабря в 21:00 и до 8:00 воскресенья проводим праздник.</p>

<p>Обычно есть какая-то «тайна», которую надо раскрыть. Например, похитили Снегурочку. Чтобы ее спасти, надо пройти много испытаний.</p>

<ol class="list">
    <li>Вытащить яблоко зубами без помощи рук из тазика с водой.</li>
    <li>На стене висят воздушные шарики. Необходимо метать иголку на спичках, чтобы их сдуть.</li>
    <li>Из закрытых бутылок через соску надо пить напиток и отгадать, что это за напиток.</li>
    <li>«Боулинг» из пластиковых бутылок.</li>
    <li>Перейти на другой берег только с помощью двух бумажных следов.</li>
    <li>«Полоса препятствий». Под натянутыми веревками команда со связанными руками должна проползти на другой берег.</li>
    <li>«Путаница». Команда «запутывается», не разнимая рук. Кто-то один должен всех распутать.</li>
    <li>Решение нестандартных логических задач.</li>
    <li>В боксерских перчатках под дробь барабана правильно завязать пионерский галстук.</li>
    <li>Рассказать новогодние обычаи нескольких стран.</li>
</ol>

<p>И много других испытаний. Всеми любимая игра — «Немая корова». Одному человеку из команды противоположная команда называет слово. Он должен без слов объяснить своей команде свои ассоциации так, чтобы они отгадали задуманное слово.</p>

<p>В 4 часа утра, когда уже пора взбодриться, наступает время для нашей любимой забавы. Это бросание туалетной бумагой. У каждого человека есть несколько рулонов бумаги. Свободный конец бумаги держим в руке, а остальной рулон по правилам надо бросить как можно дальше.</p>

<p>Все бросаются до тех пор, пока не падают от усталости. На фотографиях это зрелище выглядит очень красиво. А затем из клочков бумаги мы собираем большой снежный ком и прыгаем в него.</p>

<p>На празднике обязательно проводятся театр-экспромт, конкурсы, песни под гитару.</p>

<p>Во Дворце темно и таинственно. Каждый находит для себя минутку, чтобы посидеть около наряженной елки, поговорить с теми, кого так долго не видел. Словом, этот праздник для нас — что-то святое.</p>
`

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Здесь находится вся информация и код со страницы "Контакты".

appContent.contacts = `
<h1>Контакты</h1>

<p>
    Маргарита Михайловна Пономарева: +7-913-645-23-88, <a href="mailto:programmers@rambler.ru">programmers@rambler.ru</a>
    <br> Автор сайта — <a href="http://malyutinegor.github.io">Малютин Егор</a>. Также огромное спасибо <a href="http://vk.com/upisfree">Сене Пугачу</a> за прошлый сайт.</p>

<p>Приглашаются дети с 7 до 15 лет вместе с родителями и приносят с собой:</p>

<ul class="list">
    <li>ручку и листочек бумаги;</li>
    <li>ксерокопию свидетельства о рождении или паспорта ребенка;</li>
    <li>медицинскую справку, что ребенок может заниматься на компьютере и участвовать в массовых и спортивных мероприятиях;</li>
    <li>паспорт родителя для заключения договора на обучение.</li>
</ul>

<iframe class="gmap" src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2287.664774748698!2d73.32147641545068!3d55.01404105619184!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x43aafde390bc26cf%3A0xe049e699aedc8f10!2z0JHQntCjINCU0J4g0LPQvtGA0L7QtNCwINCe0LzRgdC60LAgItCT0L7RgNC-0LTRgdC60L7QuSDQlNCy0L7RgNC10YYg0LTQtdGC0YHQutC-0LPQviAo0Y7QvdC-0YjQtdGB0LrQvtCz0L4pINGC0LLQvtGA0YfQtdGB0YLQstCwIg!5e0!3m2!1sru!2sru!4v1526115836486" frameborder="0" , style="border: 0" allowfullscreen="true"></iframe>

<div id="vk-group"></div>

<script>
    VK.Widgets.Group("vk-group", { mode: 3, width: cont.dom.offsetWidth }, 1088622)
</script>
`

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Здесь находится вся информация со страницы "История".

appContent.history = `
<h1>История</h1>
<p>Первое занятие кружка в городском Дворце пионеров (11 ноября 1981 года), педагог Дворжецкая Марина Юрьевна.</p>
<div class="dialog-container">
    <div class="dialog-left"></div>
    <div class="dialog"> — Чем будет заниматься наш кружок?<br> — Программированием.<br> — А какова программа наших занятий?<br> — Наша программа предполагает понять, что такое «программа» и научиться ее писать...</div>
</div>
<div class="dialog-from">из Летописи кружка</div>
<p>Это, конечно, была шутка. Как ребята узнали позже, в программе еще очень много интересного. И оказалось, что самое трудное — не просто научиться писать программу, а добиться того, чтобы ЭВМ («умная машина, которая умеет все») тебя поняла. </p>
<div class="dialog-container">
    <div class="dialog-left"></div>
    <div class="dialog">...Ребята прозанимались полгода. Главный отчет о проделанной работе — конференция НОУ 18 апреля 1982 года. Доложить о результатах коллективной работы поручили А. Скатову и И. Корнюшину. Они представляют «Генератор задач по физике для 7 класса на языке Фортран».<br>Написана эта программа для <code>ЭВМ ЕС-1020</code>. Перфорация и прогонка осуществлялись в ВЦ ОмГУ. Ребята достойно выдержали испытания — у нашего коллектива первая грамота...</div>
</div>
<div class="dialog-from">из Летописи кружка</div>
<p>В это время ребята уже ездили в Летние школы юных программистов, где кроме развлекательных мероприятий ребята также участвовали в научных конференциях.</p>
<h2>1988–1993 годы</h2>
<p> Это был сильный коллектив программистов под руководством Лобовой Людмилы Александровны, участники Летних школ НОУ, конференций НОУ.</p>
<p>Самые полезные работы, известные нам:</p>
<ul class="list">
    <li>«Тренажер астронома-наблюдателя» (Гаврилюк Андрей)</li>
    <li>«Редактор спрайтов» (Пахотин Алексей)</li>
    <li>Библиотека для работы с мышкой (Мазурский Глеб, Писарев Артем)</li>
</ul>
<h2>С 1993-го года</h2>
<p>С 1993 года в кружке работает коллектив программистов под руководством Пономаревой Маргариты Михайловны.</p>
<p>До 1995 года кружок «Программист» был оснащен классом «Корветов», а также тремя компьютерами <code>IBM286</code> и одним — <code>IBM386</code>. По тем временам этих компьютеров было достаточно, но, как известно, с течением времени техника быстро устаревает, пользователям ПК требуются более мощные компьютеры и программное обеспечение.</p>
<p>В 1995 году Департамент образования выделил для нашего кружка 10 компьютеров <code>IBM PC-486</code>. Счастью ребят не было предела, когда в их распоряжении появились самые мощные и быстродействующие компьютеры на тот момент времени. Игры, новые программы, скорость — кружковцы были просто в восторге.</p>
<div class="q-container"><span class="q-left">«</span><q>...Я занимался здесь на таких компьютерах, о которых только слышал; с огромным удовольствием я вставал пораньше, собирался, ехал во Дворец пионеров. Особенно меня интересовали лекции по языку программирования Паскаль...</q><span class="q-right">»</span></div>
<div class="dialog-from">Дмитрий Пушкарев</div>
<p>На 16-летие кружка «Программист» Департамент образования подарил один компьютер <code>Pentium-200</code> и сетевое аппаратное обеспечение. Теперь все компьютеры кружка связаны в локальную сеть.<br><br>Позже кружок был полностью оснащен компьютерами <code>Pentium I</code> и <code>II</code> с достаточным объемом оперативной памяти и довольно большими тактовыми частотами. Стала возможной работа с программами трехмерного моделирования графики, языками программирования <code>Delphi 5</code> и выше.<br><br>Но потом случилась беда. Наш кружок ограбили. Все системные блоки были вскрыты, с материнских плат было снято самое ценное оборудование. То, что преступники не смогли унести, они разбили. Так случилось со сканером и еще с чем-то. Унесли все шарики от мышек — скорее всего, просто издевательство.<br><br>Это были очень трудные времена для кружка и, в особенности, для Маргариты Михайловны. В этот период среди кружковцев царила какая-то общая напряженность. Было плохо всем, и все понимали, как плохо приходится Маргарите Михайловне. Но она прекрасно держалась в этот период.<br><br>Когда все думали, что все потеряно, что кружок больше не вернуть, она одна сохраняла уверенность в дальнейшем продолжении кружковской жизни. И, в конце концов, оказалась права.<br><br>Компьютеры со временем стали появляться, сначала плохие, потом получше, а сейчас в кружке стоят очень хорошие компьютеры, даже лучше, чем были до ограбления. В деле восстановления кружка Маргарите Михайловне помогали многие люди, и нам всем хочется искренне поблагодарить родителей наших ребят, особенно Мизя С. Г., Астафурову Е. А., Круглову Л. Ф.</p>
<div class="q-container"><span class="q-left">«</span><q>...И радостно, что нам удалось сохранить коллектив кружка, несмотря на все трудности. А недавно кружок получил выход в Интернет. И нам легче будет участвовать в интернетовских проектах...</q><span class="q-right">»</span></div>
<div class="dialog-from">Дмитрий Мордвинов</div>
<p>Мы стараемся сохранять традиции кружка: участие в конференциях НОУ, в работе Летних школ НОУ, Посвящение в программисты, Новогодние ночные сборы, походы и поездки. </p>
<p>C 2001 по 2007 годы в кружке работал сплоченный коллектив единомышленников: Пономарева М. М., Швидко О. В. (с ребятами помладше), Орлова М. В. (с ребятами «математиками») и Журавок Василий (главный специалист по железу и установке программного обеспечения).</p>
`

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Здесь находится вся информация со страницы "Учёба".

appContent.education = `
<h1>Учёба</h1>
<p>Наш коллектив работает по авторским образовательным программам «Проект К-16» и «Кто я: веб-дизайнер или программист?»</p>
<p>С 2013 года для младших школьников (1-2 классы) организовано обучение по авторской образовательной программе «Азбука Роботландии» (авторы Дуванов А. А. и Шумилина Н. Д.). С этой программой можно познакомиться на <a href="http://www.robotlandia.ru/abc.htm">сайте</a>.</p>
<p>Программа по информатике «Проект К-16» удостоена <b>Диплома лауреата VII Всероссийского конкурса авторских образовательных программ дополнительного образования детей</b>.</p>
<p>Программа «Кто я: веб-дизайнер или программист?» полезна тем, кто хочет определиться, чем ему нравится заниматься: веб-дизайном или программированием.</p>
<p class="right">Цель программы «Проект К-16»: развитие информационной и социально-коммуникативной компетентности детей.</p>
<p>За первый год обучения можно освоить либо основы веб-конструирования (<code>HTML</code> и <code>CSS</code>), либо основы программирования на языке <code>Паскаль.</code></p>
<p>После изучения основ структурного программирования можно заняться изучением основ объектно-ориентированного программирования на языке <code>Java</code>.</p>
<p>Дополнительно есть возможность освоить следующие модули:</p>
<ul class="list">
    <li>«Основы <code>Delphi</code>»</li>
    <li>«Основы <code>PHP</code>»</li>
    <li>«Основы <code>JavaScript</code>»</li>
</ul>
<p>Выпускникам программы «Проект К-16» вручаются удостоверения муниципального образца о получении дополнительного образования.</p>
<h2>Программа</h2>
<p>В 2008 году педагоги Пономарева М. М., Швидко О. В. и методист Романова О. Н. получили Диплом лауреатов VII Всероссийского конкурса авторских образовательных программ дополнительного образования детей за представленную программу по информатике «Проект К-16».</p>
<p>Наша программа полезна тем, кто хочет определиться, чем ему нравится заниматься: компьютерной графикой, веб-дизайном или программированием. А уже затем можно заниматься любимым делом.</p>
<p>Цель программы — развитие информационной и социально-коммуникативной компетентности ребят.</p>
<p>За первый год обучения ребята осваивают следующие модули:</p>
<ul class="list">
    <li>Курс пользователя</li>
    <li>Основы веб-конструирования. <code>HTML</code></li>
    <li>Основы программирования на языке <code>Паскаль</code></li>
</ul>
<p>В конце года ребята получают удостоверения пользователей ПК и делятся на группы по интересам:</p>
<ul class="list">
    <li>Программисты</li>
    <li>Веб-дизайнеры</li>
</ul>
<p>Каждый ребенок может выбрать свой маршрут: можно придти сразу на второй год обучения, если уже есть базовая подготовка или изучать только те модули, которые необходимы.</p>
<p>Начиная со второго года обучения, в течение года проходят занятия по модулю «Формирование комфортной коммуникативной среды в коллективе программистов».</p>
<p>Второй год обучения программисты углубленно изучают язык программирования Паскаль, а веб-дизайнеры — язык <code>HTML</code> и основы веб-дизайна, обучаясь в Роботландском университете. </p>
<p>Третий год обучения программисты изучают основы объектно-ориентированного программирования на <code>Java</code> и могут стать выпускниками Дворца.</p>
<p>А дальше в кружке остаются те ребята, кто может самостоятельно и увлеченно работать над проектами индивидуально или в команде. Мы заинтересованы, чтобы такие ребята в перспективе пришли к нам в коллектив в качестве лаборантов или преподавателей.</p>
<p>Очень радует тот факт, что выпускники и их родители через несколько лет после окончания обучения приходят со словами благодарности. И если даже преподавателю казалось, что ребенок освоил только самый минимум образовательной программы, в школе он становится одним из лучших по информатике.</p>
<p>Значит, все было не зря...</p>
<h2>Проекты</h2>
<p>Самые глобальные разработки c 2007 года:</p>
<ul class="list">
    <li>«Easy Route. Оптимизация перевозок» (авторы Мизя Максим, Субботин Никита и Беликов Владимир, руководитель проекта — Орлова Мария Владиславовна);</li>
    <li>«Набор для ускоренной разработки приложений» (авторы Мелешкин Валерий, Сабадаж Василий, Костарев Иван, руководитель проекта — Мелешкин Валерий);</li>
    <li>«Робототехническая система автоматического моделирования пространства» (авторы Литвинов Василий, Киселевский Лев);</li>
    <li>«Операционная система JLAS» (авторы Сташевский Леонид, Литвинов Василий, Шумаков Антон, руководитель проекта — Сташевский Леонид);</li>
    <li>«Симулятор игры на гитаре» (авторы Павленко Артем, Крылова Екатерина).</li>
</ul>
<p>Первые три проекта заняли 1 место в Москве на Всероссийском конкурсе научных работ школьников «Юниор», проходившем в рамках Международного смотра научного и инженерного творчества школьников (International Science and Engineering Fair, ISEF). А последние два проекта заняли 1 место на МНСК — Международной научной студенческой конференции «Студент и научно-технический прогресс» (Академгородок, Новосибирск).</p>
<p>В 2014 году самыми серьезными проектами, получившими призовые места на МНСК, стали:</p>
<ul class="list">
    <li>«AIROS. Облачная операционная система» (авторы Юра Макаров и Ильдар Карымов);</li>
    <li>«Робототехническая система обследования местности» (авторы Павленко Артем, Крылова Екатерина);</li>
    <li>«Разработка web-приложений с использованием концепции MVC и фреймворка Yii» (авторы Юра Макаров, Сеня Пугач, Илья Горкун, руководитель проекта — В. А. Михаль); </li>
    <li>«Виртуальный тур по музею детского движения Омской области» (автор Гоша Емельянов, по заказу Л. И. Шипициной).</li>
</ul>
`

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Здесь распологается вся информация, находящаяся на странице "Люди".

appContent.people = `
<h1>Люди</h1>
<p>Программы обучения реализует преподаватель Пономарева Маргарита Михайловна, также мы каждый год приглашаем университетских преподавателей для проведения спецкурсов.</p>
<h2>Маргарита Михайловна Пономарева</h2>
<p class="right">Наш коллектив — это сплоченная команда педагогов, детей, выпускников и родителей...</p>
<p>C 1993 года работает педагогом дополнительного образования в творческой лаборатории «Проект К-16» (кружок «Программист») Городского Дворца детского (юношеского) творчества.</p>
<p>Педагог высшей квалификационной категории, Почетный работник общего образования Российской Федерации. Победитель конкурса педагогических работников, внедряющих инновационные технологии в образовании. Автор образовательной программы «Проект К-16», опубликованной в российском журнале «Внешкольник» в 2009 году. Преподает веб-конструирование и основы программирования на <code>Паскале</code> и <code>Java</code>.</p>
<p>Любит организовывать праздники и поездки вместе с ребятами кружка, участвовать в различных конкурсах и конференциях. С 1995 по 2008 годы участвовала в работе Летних школ научного общества учащихся «Поиск».</p>
<p>Любит видеть результат от работы ребят, когда они что-то делают увлеченно и получают от этого радость. Переживает, когда ребята ходят на занятия по принуждению и тратят время впустую. Считает время самым ценным ресурсом.</p>
<p>Какой результат хочет видеть от работы ребят? Чтобы они были успешными в жизни, познакомились с профессиями программиста и веб-дизайнера и занимались тем, от чего они получают удовольствие.</p>
<h2>Выпускники</h2>
<p>Каждый год в нашем кружке есть выпускники, которые отзанимались в коллективе не менее трех лет. Во Дворце проходит замечательный выпускной бал, на котором ребятам вручают удостоверения о дополнительном образовании.</p>
<p>Каждый выпускник остается в сердце педагога. На 25-летии кружка Дмитрий Мордвинов сказал о кружке и ММ замечательные слова (спасибо, Митя!), вот <a href="https://docs.google.com/document/edit?id=1n7it7zhfpsJJ0aD3fs2kLGcAU37foiyIWQGwtlZAdbY&amp;hl=ru&amp;authkey=CNqllu0P">ссылка</a>.</p>
<p>На этой странице приводятся мнения выпускников 2004 года об участии в проекте «Формирование комфортной коммуникативной среды в кружке «Программист»» (авторы Ашихина Арина, Солопова Диана, Платов Антон, Щетинин Сергей, Артамонов Олег, Демиденко Валера, Голубь Марина, Гринберг Женя, Пысин Сергей).</p>
<div class="q-container"><span class="q-left">«</span><q>Я думаю, эти мероприятия очень важны для всех. Они помогают детям научиться общаться со сверстниками. Занятия с психологами помогают познать себя в душе. Я думаю, что следующим ученикам будет полезно узнать о том, что и мы узнали.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Если бы не было дополнительных (развлекательных, интеллектуальных и других) программ, то было бы не интересно. Ведь с помощью таких программ мы общаемся, находим новых друзей, узнаем много нового и просто хорошо и весело проводим время. Я считаю, нам и другим детям нужно это.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Наш мир устроен так, что всего надо добиваться самим, но это делает человека эгоистом. А эти программы не позволяют замкнуться в себе и не быть героем-одиночкой...</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Я думаю, что это все делать нужно, но мне лично несильно помогло. Но все же делать подобные мероприятия нужно! А то, что мне несильно помогло, то я считаю, что это только мне. В принципе все получается хорошо, весело, но это не для меня. Я более «привязан» к работе, а не к веселью.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Деятельность нашего кружка, направленная на развитие коммуникабельности учеников, очень мне помогла. Во-первых, после занятий с психологами и т. п. я стала более раскрепощенной, более легко начала знакомиться и общаться с людьми. Во-вторых, для меня эти занятия в течение учебного года являются разрядкой и отвлечением от тяжелой повседневной жизни.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Это все очень важно. Помогает людям лучше понимать друг друга. У меня появилось много друзей и знакомых, а в школе таких нет. Мы много общались и общаемся с психологами. Человек с этой помощью развивается в разных направлениях. Ездим в другие города. Это все очень сильно сближает разных людей.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Мне кажется, что эти мероприятия (психологи, Ночные сборы и т. п.) нужны для саморазвития и не только — на них весело (Новогодний Ночной сбор!) и интересно. Ведь нельзя все время сидеть дома и смотреть в монитор. Нужно посещать все мероприятия, чтобы не быть замкнутым.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Во-первых, получил знания Паскаля и т. п. В кружке много раз преподаватель проводил разные интересные, познавательные, интеллектуальные игры. Также мы ходили в разные кружки во Дворце (психологи, астрономы).</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Мне кажется, я сильно изменился. Я стал всегда добиваться той цели, к которой стремился. Так же мы участвовали в разных интеллектуальных играх (повышение моих способностей). В кружке очень много хороших людей, которые помогут в нужную минуту. И можно рассказать какой-нибудь секрет (общение играет тоже большую роль).</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>За это время я не только получил информацию по вопросам, которыми я интересуюсь. Мне кажется, кружок сформировал 40 процентов меня, какой я есть сейчас, из того, каким я был тогда.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Кружок «Программист», я думаю, останется в моей памяти на многие годы. Это и приобретенные друзья, совместные праздники, обучение, сотрудничество с астрономами и психологами и многое, многое другое. Мне кажется, ничего не стоит менять. Жить, участвовать, общаться — это даже важнее, чем просто работать на компьютере.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Дети не просто сидят и смотрят в монитор, они развиваются, находят себя в различных сферах (например, устраивать праздники). Слово «кружок» подразумевает общество людей, объединенных одними интересами. Конечно, можно только учиться, но людям от этого не легче, важна та атмосфера, которая царит у нас в кабинете.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Дружелюбие, отзывчивость, желание помочь — вот то, что необходимо, чтобы мы были развиты не только интеллектуально, но и духовно, чтобы из нас получились действительно достойные люди. Если бы таких кружков (секций) было бы больше, ребята были бы добрее, нашли бы свою дорогу в жизни и возникло бы меньше проблем с окружающими. Далеко не последнюю роль здесь играет педагог. </q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Талантливый, умный, понимающий учитель, способный направить на путь истинный — все эти качества, несомненно, есть у Вас, Маргарита Михайловна. Вы умеете дать знания, но при этом быть еще и тонким психологом. Жаль, что не во всех школах есть такой классный педагог, как Вы. Я думаю, это Ваше призвание — помогать нам, учить нас, Вам не стоит что-либо менять.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Поверьте, ту любовь, тепло, которое Вы даете, не остаются незамеченными, и мы тоже Вас очень любим и ценим. Я всегда ставлю Вас в пример себе и другим и, ничуть не преувеличивая, могу сказать, что Вы — эталон и образец, к которому нужно стремиться.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Еще я хочу сказать большое спасибо психологам, астрономам и, в частности, Швидко Ольге Витальевне. Они молодцы. Встречалось бы больше таких людей в моей жизни. Маргарита Михайловна — супер, и дети у Вас такие же (Антон и Ольга).</q><span class="q-right">»</span></div>
<h2>Родители</h2>
<p>Отзывы родителей после конкурса сайтов, 2014 год.</p>
<div class="q-container"><span class="q-left">«</span><q>Конкурс понравился. Ребенку очень нравится заниматься в кружке. Наконец-то он садится за компьютер не только для того, чтобы поиграть в игры. Думаю, что навыки, полученные здесь, очень пригодятся ему в дальнейшей жизни в наш компьютерный век! Спасибо огромное, Маргарита Михайловна!</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Конкурс очень понравился, дает возможность ребенку проявить себя, поработать самостоятельно. Большой плюс в том, что отметили всех детей, всех похвалили, объяснили ошибки и промахи. Чем больше конкурсов, тем лучше. Детям полезно увидеть работы других, оценить на их фоне свой труд.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Очень понравилось. Интересная информация. Не знала, что дети учатся такому, как было представлено. Очень организовано все: фото, грамоты, медали. Все очень хорошо.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Было очень интересно увидеть работы детей. Маргарита Михайловна удивительный чуткий педагог, дающий позитив и знания.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>В этом году моя дочь настойчиво решила заниматься в кружке программирования, так как была наслышана от своего одноклассника о том, как это здорово и интересно. Я сначала очень сомневалась в успехе этого увлечения, но оказалось, что основы веб-конструирования, которым она занималась на занятиях кружка, очень увлекли ее. Дочери все очень нравилось и было интересно. Она даже сама стремилась по вечерам сесть и позаниматься. Поэтому хочется сказать большое спасибо нашему преподавателю, Маргарите Михайловне, за талант, умение увлечь детей, терпение.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Конкурс очень понравился, дети молодцы, очень интересные темы. Просьба продолжать данные мероприятия.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Получила большое удовольствие от просмотра конкурсных работ. Удивила подготовленность детей, заинтересованность в изучаемой теме. Ребята молодцы и замечательный преподаватель Маргарита Михайловна.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Только хорошие впечатления. Рад, что существует данный проект, который позволяет детям освоить базовые ИТ-технологии и способствует развитию личности и совместной работы над проектами.</q><span class="q-right">»</span></div>
<div class="q-container"><span class="q-left">«</span><q>Маргарита Михайловна, большое Вам спасибо за терпение и за доброе отношение!</q><span class="q-right">»</span></div>
`
